{"posts":[{"metadata":{"title":"Your product doesn’t judge you; people do.","date":"2013-08-28T00:00:00.000Z","image":"/images/papaya-farm.jpg","description":"Selling sucks, but you need to get your project out in the real world.","relativePath":"/blog/your-product-doesn-t-judge-you-people-do.html","friendlyDate":"Aug 28, 2013","type":"article"},"content":"\nI ran in to [Doug](http://www.infieldhealth.com/about-us/), a fellow entrepreneur in the [1776 startup co-working space](http://1776dc.com/), today at the coffee/water/pb&j oasis. After exchanging a few words, we somehow found our way into a conversation about being in a small company and the battle between focusing on ***sales*** and focusing on ***product***.\n\nWhat we agreed on was that being out in the wild, pounding pavement, selling your product is exactly what every single startup founder and/or entrepreneur should be doing. Doug told me that he likes my company, [RidePost](https://www.ridepost.com/), because we are not hiding in our code, adding this and that feature, saying, _&quot;If we just add/change/remove this one feature, people will start to buy our product!&quot;_\n\nI know this has been written about 1 x 10^255 times, but he said something in this conversation which really hit home:\n\n\n* * *\n\n> ***&quot;Your product doesn’t judge you; people do.&quot;***\n\n* * *\n\nFact: **It is easier to hide in your product than take the beating that is the outside world.**\n\n**Selling sucks**. You know that terrible feeling in middle school where you ask the girl of your dreams if you can walk her home and she says no? Yeah, that. Every day. Forever. Most developers would rather deal with failing unit tests than deal with the anxiety and inevitable depression that is sales. However, when you don’t have your very own sales team, you have got to learn to take this. If you do not, then you should stop what you’re working on, return your friends/family funding and go home.\n\n**“But how will sales build the product I’m selling if I’m not focusing on product?”** First of all, sales will not only _allow_ you to continue building your product, but it will also _drive_ what your product becomes. It is pointless to build a product that people do not need and are not willing to buy. For example: I can build a 100% gas-free, solar-powered lawn mower that leaves zero carbon footprint and is super duper in every respect. But nobody is going to buy this when gas-powered ones are cheaper and have worked fine for >50 years. Regardless of how amazing your product is, if people don’t need it right now, they are not going to buy it. Instead, let potential customers beat your idea in to the ground. **Take their blows, but also take notes.** You will likely see a pattern evolve after your dreams have been crushed in to the ground for the thousandth time. Let these sales experiences drive (and fund) what your product becomes.\n\n**TL;DR** => Stop hiding in a fantasy world of product and go out and sell something first. When you’ve got customers beating down your door, then you can go heads down.\n"},{"metadata":{"title":"Moving To London","date":"2014-09-01T00:00:00.000Z","image":"/images/london-tree.jpg","description":"If you can go on an adventure, then what are you waiting for?","relativePath":"/blog/moving-to-london.html","friendlyDate":"Sept 1, 2014","type":"article"},"content":"\n2 months ago I decided I wanted to go to London for an indefinite amount of time.\n\nThere were no external driving factors behind this decision; no significant other, no new job, no criminal charges, no desire to leave my home in Charleston, SC.\n\nI love my family, friends, beaches, the spartina grass (marshes), the plough mud, and the\nodd&mdash;yet wonderful&mdash;assortment of personalities that exist in Charleston.\n\n* * *\n\n> _&quot;If everything is so wonderful, why leave?&quot;_\n\n* * *\n\nBecause I can. Because of this list of things I don't have:\n\n*   no wife\n*   no kids\n*   no house\n*   no debt\n\nHere is another way to view this list:\n\n*   wife-free\n*   kid-free\n*   house-free\n*   debt-free\n\nI understand that &frac34; of the items on that list are desired by many folks, and that what I have just described could also be classified as &quot;responsibility-free.&quot; Or, as I have understood before, that _the life of the traveler is rootless and thereby does not bear the burden of creating something lasting_. I find this statement accurate; however, I also find that safety makes me complacent and breeds stagnation and settling: the opposite of my battle and striving for excellence, or the Greek _areté_. Thus, in order to better myself, I decided to shake things up a bit!\n\nAdditionally, and worthy of note, every single person I spoke with about traveling this way said this:\n\n* * *\n\n> _&quot;If I were you, I'd be gone in a second.&quot;_\n\n* * *\n\nI will miss my grandparents, parents, siblings, my dogs, aunts, uncles, cousins, surfing, and everything that makes Charleston great.\n\nBut I shall return!\n\n## My Time Thus far\n\nAfter serenading the Delta counter attendants in the Charleston airport with my guitar and song, I had a sleepless and safe flight to London!\n\nWhen I finished riding a number of trains and other ground transportation, I arrived in [Clapham](https://www.google.com/maps/preview?q=clapham+london&ie=UTF-8&ei=ApsEVOSbJaeu0QXc84HYCw&ved=0CAYQ_AUoAQ \"Clapham Google Map\") at Sam's house, where I was greeted with smiles, cheers, and Heineken.\n\nSoon thereafter, I decided to get to know my new area better. My solution? _Go on a run and get lost._ Here is my fitbit from that day:\n\n<img src=\"/images/london-fitbit.jpg\" alt=\"My first day in London fitbit data\" title=\"My first day in London fitbit data\" width=\"300\" />\n\nYou could say I got lost. I like to think I was &quot;exploring.&quot; Nevertheless, I had a fantastic time and look forward to many more.\n"},{"metadata":{"title":"Working In London","date":"2014-09-03T00:00:00.000Z","image":"/images/clapham-cafe.jpg","description":"What it's been like working in London for a few days.","relativePath":"/blog/working-in-london.html","friendlyDate":"Sept 3, 2014","type":"article"},"content":"\nI spend the majority of my time writing software for [Articulate](http://www.articulate.com \"Articulate\"). This isn't the offical mantra, but it is how I think of the company:\n\n> _&quot;Work when you want,<br />\n> where you want;<br />\n> just don't be a jerk.&quot;_\n\nSound too good to be true? It is true.\n\nArticulate is a \"remote\" or \"virtual\" company, meaning it has no physical offices anywhere in the world, and everyone works wherever they like. Many of my colleagues work from home, whereas others tend to shift around a bit. It is this freedom that was (and _is_) a primary driving force for me wanting to work with this company.\n\n## Locations Thus Far\n\nLondon is an expensive town, especially when you're exchanging American Dollars for British Pounds Sterling. [NomadList.IO](http://nomadlist.io/ \"NomadList.IO\"), a site that ranks cities to work remotely from, does not treat London kindly. At the time of writing, London has a -89 reputation&hellip; on a scale where positive is a good thing. While it is an expensive town, it is also incredibly friendly, and there is no shortage of WiFi.\n\nSo, where have I worked over the past two days? For starters, I had a small taste of [South Kensington](https://www.google.co.uk/maps/place/South+Kensington/@51.49409,-0.17411,17z/data=!3m1!4b1!4m2!3m1!1s0x487605429cf5afd1:0xfef74f40edb435de?hl=en \"South Kensington Google Map\"). I worked in a small coffee shop 2 blocks from the [Victoria and Albert Museum](http://www.vam.ac.uk \"Victoria and Albert Museum\"), and around lunch I took a stroll through a few of the free galleries before receiving word that my roommate's girlfriend was locked _in_ the apartment and could not get out. She was freed soon thereafter when I returned home and unlocked the door.\n\nToday was spent mostly near Clapham Junction (5-10 minute walk from our house) in, first, a Starbucks and then in an Italian cafe up the hill from our house (1-2 minute walk). Starbucks is fantastic for attempting to offer free WiFi to their customers. I'm not sure who started that trend, but it is great. However, in any big city I go to, Starbucks' WiFi never actually works. It reminds me of the $1/ticket Megabus WiFi in the States (in short, it doesn't work). Thankful as I am for even having access to the Internet, whereas so many people are without, I require it for my job. And I need it to be fast. Luckily, the little Italian cafe (ran by Francesca and, I believe, her son) have blazing fast internet.\n\n## The Experience\n\nI love _not_ working in an office. I love the freedom. I love being able to walk and ride around and do what I want (or need) to do while still being a contributing member of my team.\n\nMany people I know ask me,\n\n* * *\n\n> _&quot;When are you going to get a real job?&quot;_\n\n* * *\n\nI always respond with, \"Oh, I don't know&hellip;\" But what I want to say is,\n\n* * *\n\n> &quot;I have a real job. I have a salary, I have benefits and I have responsibility. __Just because your definition of a real job involves long hours, living for weekends and generally hating life does not mean that it is a universal truth by which all must abide.__&quot;\n\n* * *\n\nInstead of spending loads of time during the workday perusing\n[CNN](http://www.cnn.com \"CNN\")\nor [Reddit](http://www.reddit.com \"Reddit\")\nor [Hacker News](https://news.ycombinator.com \"Hacker News\"),\nI am out exploring, meeting new people and taking in as much as my limited time here will\nallow me.\n\nLondon, so far, has been amazing and has allowed me to leave my comfort zone and discover\npeople, places and experiences that I would never have had if I would have just stayed home.\n"},{"metadata":{"title":"Berlin","date":"2014-09-11T00:00:00.000Z","image":"/images/startupbootcamp-berlin.jpg","description":"Reflections on my first trip Berlin.","relativePath":"/blog/berlin.html","friendlyDate":"Sept 11, 2014","type":"article"},"content":"\nTraveling to Berlin for the first time, one cannot help but marvel at a city and people so steeped in painful history. All Americans learn of the Berlin where Hitler ruled, where the Russians paraded down the streets after they reached the city before the other Allies could and where the Berlin Wall was erected and felled. While this is not the city that exists today, there are bold, powerful reminders hidden throughout the city that remind the populace and visitors of what happened so that no one may ever forget. While I did not travel here under the pretense of historical appreciation, the knowledge of past events and an appreciation of its people made my trip all the more rich.\n\nThree weeks ago, a business partner and I received an email invitation from an event company, [hy!](http://hy.co \"Hy!\"), asking if we would like to attend and participate in a mobility conference in Berlin. Naturally, we said \"yes!\" without hesitation. After forgetting my passport, missing my first flight and running in to [Tyrion Lannister (Peter Dinklage)](http://www.wikiwand.com/en/Tyrion_Lannister \"Tyrion Lannister\") in the Gatwick, London airport, I finally made my way to Berlin.\n\nThe [AirBNB](https://www.airbnb.com \"AirBNB\") accomodations were thankfully booked by my business partner, Marty, who joined me on this trip. We stayed in a clean studio apartment with a balcony near the _Uhlandstraße_ train station.\n\n<img src=\"/images/uhlandstrasse-apt.jpg\" alt=\"Marty and my AirBNB\" title=\"Marty and my AirBNB\" />\n\n<img src=\"/images/uhlandstrasse-balcony.jpg\" alt=\"Balcony\" title=\"Balcony\" />\n\nGiven Marty was no stranger to the area, my first night consisted of a walking tour through the streets around our AirBNB with _0,5L_-sized beers in hand (this is actually legal).\n\nThe following day consisted of attending the _hy! mobility_ conference. In attendence were representatives from very impressive companies, including\n\n*   [Lufthansa](http://www.lufthansa.com \"Lufthansa\")\n*   [Uber](https://www.uber.com \"Uber\")\n*   [carpooling.com](http://www.carpooling.com \"carpooling.com\")\n\nand various other noteworthies. There were three group workshop sessions that debated various trends, upcoming technologies, issues and recent regulatory hurdles ([sorry, Uber](http://www.ft.com/cms/s/0/c64c4b42-3279-11e4-a5a2-00144feabdc0.html \"Uber banned in Germany\")) many of the companies face. I felt incredibly welcome during the conference and was happy to be surrounded by so many passionate players in the mobility game.\n\n<img src=\"/images/marty-till-robert.jpg\" alt=\"Marty and Robert (RidePost) and Till (carpooling.com)\" title=\"Marty and Robert (RidePost) and Till (carpooling.com)\" />\n\nAfter the conference, the attendees of the conference were allowed to drive brand new [Audi A4s](http://www.audiusa.com/models/audi-a4 \"Audi A4\") around Berlin to the location of our dinner, [Tiergarten](http://www.berlin.de/orte/sehenswuerdigkeiten/tiergarten/index.en.php \"Tiergarten\"). Sadly, neither I nor Marty possessed German drivers' licenses, so we had to ride in the back. Our &quot;driver,&quot; John, and our Audi representative, Kathleen, decided we would _not_ be going straight to Tiergarten and would be instead taking a slight detour to test the car's capabilities along a more scenic route. Kathleen was hilarious (a great saleswoman!), and John drove like a pro.\n\n\nThe evening consisted of many half-liter beers, tons of food and fantastic company at the restaurant in the heart of Tiergarten.\n\n\n<img src=\"/images/tiergarten-water.jpg\" alt=\"Tiergarten\" title=\"Tiergarten\" />\n\nGerman beer plus a late night equals a very late start the following morning! Once revived, Marty and I made our way to the headquarters of Berlin's [Startup Bootcamp](http://www.startupbootcamp.org/accelerator/berlin.html \"Startup Bootcamp\") for Marty's meeting with the heads of a fellow <a title=\"GAN (Global Accelerator Network)\">GAN (Global Accelerator Network)</a> accelerator (backstory: Marty is the Managing Director of [The Iron Yard accelerator](http://theironyard.com/accelerator \"The Iron Yard accelerator\"), also part of the GAN family, that is based in Greenville, SC). We arrived amidst a throng of camera crews interviewing startups who were prepping for in-depth sessions with mentors. Tanja (the co-MD) and Louise received us. While we were treated to free cappuccino and lunch and had a nice time speaking with Louise and a few startups, one thing I know from living in the South is that if you have guests in your house, you should never leave them to wander and, instead, should keep someone with them at all times. Meandering about someone's home/open office space can be an awkward experience. Alas, this was not the case with us while we were guests, but I suppose they were simply too busy.\n\nThe remainder of our day carried us all over Berlin. We consulted Google Maps for our dinner and found a fantastic place, [Dicke Wirtin](http://www.dicke-wirtin.de \"Dicke Wirtin\"), near our AirBNB around the corner from _Uhlandstraße_. We sat at a table with two middle-aged German men who were nice as they could be, ate _shnitzel_, and drank. **I absolutely recommend visiting this place if you visit the area!**\n\nBelow are a few images from the day &amp; night.\n\n<img src=\"/images/berlin-the-wall.jpg\" alt=\"Part of Berlin Wall\" title=\"Part of Berlin Wall\" />\n\n<img src=\"/images/nazi-poland-history.jpg\" alt=\"Nazi-Poland history\" title=\"Nadi-Poland history\" />\n\n<img src=\"/images/dicke-wirtin.jpg\" alt=\"Dicke Wirtin restaurant\" title=\"Dicke Wirtin restaurant\" />\n\nMy time in Berlin was an odd mix of the new with the antiquated; the shiny with the faded and dull; excitement for the future existing alongside the pain of the past. I thoroughly enjoyed every moment of my time here. Now, having embraced the friendliness of the people, tasted the delicious food and viewed marvelous structures, I must visit Berlin again!\n"},{"metadata":{"title":"Chief","date":"2014-09-23T00:00:00.000Z","image":"/images/chief.jpg","description":"Tonight, I lost a dear friend.","relativePath":"/blog/chief.html","friendlyDate":"Sept 23, 2014","type":"article"},"content":"\nTonight, I lost a dear friend.\n\nOn this day, 23 September 2014, my family lost a constant. Chief, a member of our family, passed &mdash; by our hand &mdash; on account of aggressive cancer.\n\nChief made me better. Or, Chief made me make myself better.\nI will never forget one moment, one line of his life, I swear.\nHe will always be my brother, my son, my guide.\n\nI love you, man.\n"},{"metadata":{"title":"Exercising In Transit","date":"2014-09-29T00:00:00.000Z","image":"/images/outdoor-gym.jpg","description":"Exercising while you travel can be difficult -- let's work through this.","relativePath":"/blog/exercising-in-transit.html","friendlyDate":"Sept 29, 2014","type":"article"},"content":"\nMany folks who travel are no strangers to a general decline in health (and bank account funds!) while on their adventures. Apart from being less likely to cook their own meals, the general lack of exercise people also experience while on the move in new, unfamiliar places, creates a cycle of unhealthiness that is difficult to break. Since I've moved to London, I have had to consider my options and find a way to maintain a healthy diet while also getting regular,\nmeaningful exercise. Luckily, London itself has come to the rescue.\n\nSince 2007, [The Great Outdoor Gym Company](http://www.tgogc.com/Gyms \"The Great Outdoor Gym Company\"), at the behest of local councils, has installed hundreds of outdoor gyms &amp; obstacles in parks all throughout the UK (notably London). There are surely other vendors, but this is the only one of which I know.\n\nThe gyms sport everything from pullup &amp; parallel bars to vertical presses to elliptical machines. Clapham Common, where I exercise, possesses at least three outdoor gyms that are heavily used every day and have surprisingly low maintenance plus resistance to the elements.\n\n* * *\n\n> _&quot;Great; loads of gyms! Now what?&quot;_\n\n* * *\n\nThe phrase _weary traveler_ is fairly descriptive of the effects of travel on people. Whether you are walking, sitting or sleeping for a long time, the effects are similar: you are tired! And the last thing you want to do when you're tired is exercise. This needs to change.\n\nDo you have a good work ethic? Are you rarely late to work or meetings? What is it about these that make you attend and do so in a timely fashion? You probably say, &quot;This is something I have to do, so I am going to power through and do it, even if I don't want to.&quot; So why not treat exercise in this manner?\n\nIn short, you need to learn to _treat exercise like an unavoidable daily event_; like a meeting.\nIf you can do this, then all procrastination and &quot;I'll do it when I feel like it&quot;\nexcuses go right out the door.\n\nIf you are worried about not having a place to work out in the area you are traveling to,\ndo a little research beforehand.\n\n*   Google for outdoor/indoor gyms in the area\n*   Youtube exercises you can do in your hotel room\n*   Use Yelp to find places where you can eat right &mdash; not lazily\n\nUltimately, all of these decisions come down to you.\nWhether you are on a short trip or are doing extensive traveling,\nif you take it upon yourself to strive for a sound mind and body,\nyou will find a way to better yourself while on the road.\n"},{"metadata":{"title":"On Working Remotely","date":"2014-10-15T00:00:00.000Z","image":"/images/lavish-habit.jpg","description":"You can work remotely, too! Here's how.","relativePath":"/blog/on-working-remotely.html","friendlyDate":"Oct 15, 2014","type":"article"},"content":"\nDo you have a remote/virtual/telecommute job? I do. And it rocks.\n\nA vast majority of the people in the States who inquire as to the nature of my job\nshare with me that they feel working remotely would make them feel isolated; that they\nwould lose their sense of team; that they would get bored.\n\n## Boredom? Nope.\n\nSomeone once said to me,\n\n* * *\n\n> _&quot;Only boring people get bored.&quot;<br />\n> <small>&mdash; every badass person, ever</small>_\n\n* * *\n\nLet that sink in for a second. Let yourself recognize that you might just be boring.\nWhile you think about it, read this introduction on boredom from Wikipedia:\n\n* * *\n\n> _&quot;Boredom is an emotional state experienced when an individual is left without anything in particular to do, and not interested in their surroundings.&quot;_\n\n* * *\n\nComma usage aside, this says _a lot_ about people who get bored. If you have nothing in particular to do, well, that's great, but odds are that you do not have a family or are not contributing to humanity (there's much to do here). Your choice. I would like to focus on the second point: _&quot;and not interested in their surroundings.&quot;_\n\nWorking remotely allows you to work from wherever you want, given you can accomplish your work goals. It doesn't matter if you are an accountant, human resource associate, technology professional or doctor. Thanks to the present-day methods of communication, knowledge and data can be transferred in any number of ways. Many remote workers choose to do their work from the comfort of their homes where they can be nearer to family and friends and not waste their lives away in commuter traffic. Others move to new locations as they please. Regardless of what these people choose, one fact remains: _they can go wherever they want,_ or in another light, _have an infinite opportunity for new, interesting surroundings_. If they were boring before, they now have the freedom to never be bored again.\n\n## Isolated? No sense of team? Nope.\n\nNow that we've addressed the boredom fear, let's focus on the isolation and loss-of-team mentality.\n\nI write software. You might associate this with sitting in a dark room, chugging Coca-Cola, solving complex problems with microwavable fish sticks and living in solitude. You wouldn't be wrong about the fish sticks. But solitude? Can you say that you spend six hours at work speaking with anywhere from 1 to 14 people at a time? Physically, I might not be in the same room as someone, but by the end of the day I am exhausted from the sheer amount of conversation and problem solving I have with my colleagues. I just don't have to smell them.\n\n## How I Am Living\n\nOne of the attractions to the job I'm working now is that the company, [Articulate](http://www.articulate.com \"Articulate\"), has no office and is completely virtual. I recently learned that it is the **2nd largest virtual company in the world**. This means that I have the guidance of an entire company of remote workers. What sort of guidance do they offer?\n\n* * *\n\n> _&quot;Live your life, and do not waste the opportunities and time you have.&quot;_\n\n* * *\n\nSo I packed a bag and moved to London. I travel to different areas of town ~4-5 days a week, find wifi, do my work, explore, meet people, go find another place to work and then go exercise at an outdoor gym. Oh, and I've been to Berlin and have Spain, Scotland and Ireland all coming up in the next 1.5 months. And I just got back from five days in Miami.\n\nI am of the (generally agreed upon scientific) opinion that I shall not live forever, so I'll be damned if I regret one day.\n\n## Not sure where to start?\n\nThere is a program starting next year, [Remote Year](http://www.remoteyear.com \"Remote Year\"), that involves ~100 remote workers traveling to cities around the world for 2-5 weeks at a time. In each city they will be working, exploring, absorbing the culture and then moving on to the next city. I will be applying, and if you manage to find/have a remote job, so should you.\n\nTrust me; you won't get bored.\n"},{"metadata":{"title":"Be Better","date":"2015-01-15T00:00:00.000Z","image":"/images/primrose_hill.jpg","description":"We are not always the people we strive to be. Many of us want to be better versions of ourselves: wiser, kinder, stronger, skinnier. However, we often find it is ourselves that get in the way of this.","relativePath":"/blog/be-better.html","friendlyDate":"Jan 15, 2015","type":"article"},"content":"\nWe are not always the people we strive to be. Many of us want to be better versions of ourselves: wiser, kinder, stronger, skinnier. However, we often find it is ourselves that get in the way of this.\n\nSome time ago, I began removing things from my life that did not help me on the path to being the person I desired to be. This is a very painful yet effective attempt at a remedy. Unfortunately, it is only a piece of the puzzle. While external factors influence our habits and tendencies a great deal, all decisions have an ultimate decision-maker: you.\n\nI could go on with this post for days. Instead, I'll make it simple:\n\n* Be kinder to the cashier at the grocery store.\n\n* Be someone whose positive attitude inspires others.\n\n* Be confident in accomplishing your goals or lifestyle changes.\n\n* __Be better than you were yesterday.__\n"},{"metadata":{"title":"Use Bcc","date":"2015-01-19T00:00:00.000Z","image":"/images/bcc.jpg","description":"Reminder to not send mass emails.","relativePath":"/blog/use-bcc.html","friendlyDate":"Jan 19, 2015","type":"article"},"content":"\nI have a new feature request for email applications: __if there are a multitutde of addresses in the \"To:\" field, recommend the author use Bcc__ (and give a checkbox with the option to never ask this question again).\n\nLet us begin with this sage tweet from [Marty Bauer](https://twitter.com/bauermarty):\n\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">Sending a mass email and not bcc&#39;ing everyone is like a kicker missing an extra point. You had one job.</p>&mdash; Marty Bauer (@bauermarty) <a href=\"https://twitter.com/bauermarty/status/553279657890816001\">January 8, 2015</a></blockquote>\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n## What is Bcc?\nFor those of you who've never thought twice about this email field, it stands for _blind carbon copy_. The addresses in this field will not be shared with the other recipients of the email.\n\n## Mass Emails are Obnoxious\nNobody wants to read the 90 responses and side conversations from the folks that love to always \"Reply All.\"\n\n## Mass Emails Hinder Recipient Privacy\nDear Startup Founder/Venture Fund Manager/Chamber of Commerce affiliate,\n\nWhen you send out a mass email to a group of investors, you are forfeiting each one of these people's emails (and a bit of their privacy) to the other recipients, as well as anyone to whom this email is forwarded. Don't do this.\n\nLove,\n\nResponsible Users of the Internet\n\n## It's Okay; We've All Done It\nWe've all made this mistake and (hopefully) learned from it. Don't fret your hideous tendancies of emails past. Go forth from this day and send your 50 person email&mdash;_using Bcc_&mdash;with the confidence that you are not being a jerk.\n"},{"metadata":{"title":"RiotJS Example","date":"2015-01-28T00:00:00.000Z","image":"/images/riotjs.jpg","description":"A quick-dive in to RiotJS, with examples.","relativePath":"/blog/riotjs-example.html","friendlyDate":"Jan 28, 2015","type":"article"},"content":"\nWhen I look at any of the myriad JavaScript UI libraries out there, I now ask two questions:\n\n* Does data flow in one direction?\n* Do updates to the UI happen intelligently?\n\nI am a fan of Facebook's [ReactJS](https://facebook.github.io/react/) library because of its DOM diffing (via the \"virtual DOM\") and one-way data binding. React is a tool I use every day and have come to enjoy (sans-JSX), but I am always on the lookout for way to do things simpler.\n\nA colleague of mine recently shared the second iteration of [RiotJS](https://muut.com/riotjs/) with me. Of course, I was sucked in because it compared itself with React (a bold statement). You can [view the comparisons between Riot and React](https://muut.com/riotjs/compare.html) for yourself.\n\nOne unfortunate fact about fledgling JS libraries is that they lack examples of how to accomplish common goals for the web. This is an attempt to help out with that.\n\n## Installation\n\n### Project-Specific\n<span class=\"strikethrough\">While I am not a fan of Facebook's JSX (and don't use it--more to come in future blog posts on this), Riot's pre-compiled syntax is much easier to swallow.</span> Given you have a `package.json` set up, you can easily install the Riot compiler as a development dependency\n\n```bash\n$ npm install riot --save-dev\n```\nand then set up Riot to run as an NPM script and watch for any changes\n\n```javascript\n\"scripts\": {\n  \"watch:riot\": \"riot -w src/ build/\"\n}\n```\n\nwhich is then run by a simple\n\n```bash\n$ npm run watch:riot\n```\n\nAlternatively, you can [download the riot.js library](https://muut.com/riotjs/download.html) via any of their recommended methods.\n\n### Global Installation (alternative)\nIf you don't have a `package.json` and want to install Riot globally:\n\n```bash\n$ npm install riot -g\n$ riot -w src/ build/\n```\n\n## Tab Example\nI decided to start small and make a tabbing example where clicking a tab shows content related to it underneath.\nHere is the final product:\n\n<iframe class=\"iframe--example\" frameborder=\"0\" src=\"https://rpearce.github.io/riotjs-examples/tabs.html\" style=\"height: 550px;\"></iframe>\n\n### Step 1: Start With Markup\nStarting with a blank HTML document, add the `<riot-tabs></riot-tabs>` tag to your document:\n\n```html\n<!DOCTYPE html>\n<html>\n  <head></head>\n  <body>\n    <riot-tabs></riot-tabs>\n  </body>\n</html>\n```\n\nAs mentioned previously, we know we need the (very tiny) RiotJS library, so don't forget to include it:\n\n```html\n<body>\n  <riot-tabs></riot-tabs>\n\n  <script src=\"path/to/riot-2.0.1.js\"></script>\n</body>\n```\n\nEasy enough, right? Given Riot doesn't write our applications for us, we will need to tell Riot to mount some component, which in this case is \"tabs.\"\n\n```html\n<body>\n  <riot-tabs></riot-tabs>\n\n  <script src=\"path/to/riot-2.0.1.js\"></script>\n  <script>riot.mount('riot-tabs')</script>\n</body>\n```\n\nWhen we run this code through the browser, we're going to receive an error telling us that `'tabs'` is not a thing. Congrats! Time for Step 2.\n\n### Step 2: Creating Your Custom Tag\nRiot's NPM package, as mentioned earlier, allows us to write and compile pseudo-markup mixed with a little JS. To get started, create a `src` folder and add a `tabs.tag` file to it, then run\n\n```bash\n$ npm run watch:riot\n```\n\nif you have an NPM script set up or\n\n```bash\n$ riot -w src/ build/`\n```\n\nto compile and watch for more changes to the file/folder.\n\nBack in the `tabs.tag` file, add this:\n\n```html\n<riot-tabs>\n  <h2>Tabs</h2>\n  <ul>\n    <li class={ tabItem: true }>Tab 1</li>\n    <li class={ tabItem: true }>Tab 2</li>\n    <li class={ tabItem: true }>Tab 3</li>\n  </ul>\n</riot-tabs>\n```\n\nThat looks almost exactly like vanilla HTML, save for the conditional class(es), which we will use later with `is-active` classes. Also, they are way better than concatenating `className` strings yourself.\n\nRefreshing your browser will show you that you now have content that is nested within a `<riot-tabs></riot-tabs>` tag.\n\nNext up, we can add in the different tabs' contents:\n\n```html\n<riot-tabs>\n  <h2>Tabs</h2>\n  <ul>\n    <li class={ tabItem: true }>Tab 1</li>\n    <li class={ tabItem: true }>Tab 2</li>\n    <li class={ tabItem: true }>Tab 3</li>\n  </ul>\n  <div class=\"tabContent\">\n    <div class={ tabContent__item: true }>(1) Lorem ispum dolor...</div>\n    <div class={ tabContent__item: true }>(2) Lorem ispum dolor...</div>\n    <div class={ tabContent__item: true }>(3) Lorem ispum dolor...</div>\n  </div>\n</riot-tabs>\n```\n\nOkay, this is no big deal, so far.\n\nBeing software developers, we hate writing things over and over, so let's start with the tabs.\n\n```html\n<riot-tabs>\n  <h2>Tabs</h2>\n  <ul>\n    <li each={ tab, i in tabs } class={ tabItem: true }>{tab.title}</li>\n  </ul>\n  <div class=\"tabContent\">\n    <div class={ tabContent__item: true }>(1) Lorem ispum dolor...</div>\n    <div class={ tabContent__item: true }>(2) Lorem ispum dolor...</div>\n    <div class={ tabContent__item: true }>(3) Lorem ispum dolor...</div>\n  </div>\n\n  this.tabs = [\n    { title: 'Tab 1' },\n    { title: 'Tab 2' },\n    { title: 'Tab 3' }\n  ]\n</riot-tabs>\n```\n\nRiot has a nice each={ item, i in array } attribute, similar to JavaScript's for ... in ...\n\nWhile we're at it, why not iterate over the content items, as well?\n\n```html\n<riot-tabs>\n  <h2>Tabs</h2>\n  <ul>\n    <li each={ tab, i in tabs } class=\"tabItem\">{tab.title}</li>\n  </ul>\n  <div class=\"tabContent\">\n    <div each={ tab, i in tabs } class=\"tabContent__item\">{tab.content}</div>\n  </div>\n\n  this.tabs = [\n    { title: 'Tab 1', content: \"(1) Lorem ipsum dolor\" },\n    { title: 'Tab 2', content: \"(2) Lorem ipsum dolor\" },\n    { title: 'Tab 3', content: \"(3) Lorem ipsum dolor\" }\n  ]\n</riot-tabs>\n```\n\nNext, we need to set a default \"active tab\" and \"active content.\"\n\n### Step 3: Conditional Classes\nWe want to be able to specify a default tab and tab content. This is accomplished via a conditional `is-active` class on both the `.tabItem` as well as the corresponding `.tabContent__item`. To keep track of what tab/content is active, we can\n\n* add a property to the `this.tabs` array objects\n* set an `activeTab` property and\n* create a function to check if the currently iterated tab is the `activeTab`\n\n```html\n<riot-tabs>\n  <h2>Tabs</h2>\n  <ul>\n    <li each={ tab, i in tabs } class=\"tabItem { is-active: parent.isActiveTab(tab.ref) }\">{tab.title}</li>\n  </ul>\n  <div class=\"tabContent\">\n    <div each={ tab, i in tabs } class=\"tabContent__item { is-active: parent.isActiveTab(tab.ref) }\">{tab.content}</div>\n  </div>\n\n  this.tabs = [\n    { title: 'Tab 1', ref: 'tab1', content: \"(1) Lorem ipsum dolor\" },\n    { title: 'Tab 2', ref: 'tab2', content: \"(2) Lorem ipsum dolor\" },\n    { title: 'Tab 3', ref: 'tab3', content: \"(3) Lorem ipsum dolor\" }\n  ]\n\n  this.activeTab = 'tab1'\n\n  isActiveTab(tab) {\n    return this.activeTab === tab\n  }\n</riot-tabs>\n```\n\nSince these are _conditional_ classes, they will either be evaluated as true or false (I believe that anything that is not falsy is considered true; for example, `new Date()` is considered `true`). Here, we create a function called `isActiveTab` and call it from the item itself, but because the function is not scoped to the item, we need to access the `parent` scope and call the function on that.\n\nFinally, we need a way to react to _events_.\n\n### Step 4: Toggling the Tabs\nWhen we click on a tab, we want that tab to now be active, and we want the corresponding tab content to be displayed. This can be done via an `onclick` handler that calls a function on the parent called `toggleTab`\n\n```html\n<riot-tabs>\n  <h2>Tabs</h2>\n  <ul>\n    <li each={ tab, i in tabs } class=\"tabItem { is-active: parent.isActiveTab(tab.ref) }\" onclick={ parent.toggleTab }>{tab.title}</li>\n  </ul>\n  <div class=\"tabContent\">\n    <div each={ tab, i in tabs } class=\"tabContent__item { is-active: parent.isActiveTab(tab.ref) }\">{tab.content}</div>\n  </div>\n\n  this.tabs = [\n    { title: 'Tab 1', ref: 'tab1', content: \"(1) Lorem ipsum dolor\" },\n    { title: 'Tab 2', ref: 'tab2', content: \"(1) Lorem ipsum dolor\" },\n    { title: 'Tab 3', ref: 'tab3', content: \"(1) Lorem ipsum dolor\" }\n  ]\n\n  this.activeTab = 'tab1'\n\n  isActiveTab(tab) {\n    return this.activeTab === tab\n  }\n\n  toggleTab(e) {\n    this.activeTab = e.item.tab.ref\n    return true\n  }\n</riot-tabs>\n```\n\nThe `onclick` event handler receives an event object that is packed with information. What we want is the current tab that we are clicking on, and this is accessed through `e.item.tab.ref`, which is just the `ref` property on the `tab` object of the currently iterated `item`.\n\nAccording to the Riot docs, when an event handler is called, Riot will automatically call `this.update()` and re-render the component. However, I found that after I altered my data, I had to `return true`.\n\nOnce this event handler is completed and the component is re-rendered, the correct tab and content will be displayed, and you will be happy.\n\n## Wrap up\nIn sum, playing with Riot was a mostly enjoyable experience, and I am thankful to the [Muut](https://muut.com/) folks for releasing it.\n\nWhile there are quirks (single quote vs double quote issues, among others) and opinions (neglecting the use of semi-colons, as well as `return`s), this is a promising UI library that I am _definitely_ going to consider vs. React in my future projects.\n"},{"metadata":{"title":"Life in Colorado","date":"2015-03-03T00:00:00.000Z","image":"/images/colorado.jpg","description":"An update from my experiences in Colorado.","relativePath":"/blog/life-in-colorado.html","friendlyDate":"Mar 3, 2015","type":"article"},"content":"\nOne month ago, with an entire world to travel at my fingertips, I chose to temporarily move to Denver, Colorado. For years I have heard great things about the people, hiking, skiing and beer, so I decided to give them a try.\n\n## The People\nThe following statement may cause me a bit of flack in the South, but\n\n> _&quot;Denver has the most welcoming population I've ever come across\n> in my travels.&quot;_\n\nNever in my life have I met such a warm, trusting, &quot;do good&quot; people who have a blind affinity for strangers of all shapes, colors and creeds. Since my first day here, I have questioned whether I simply haven't met enough people or experienced enough of the city to see its faults. But my initial premise is supported day after day and experience after experience.\n\nOne can tell much about the culture of a city by a few things:\n\n* the attitude of its drivers towards foot traffic\n* the treatment of and by service industry workers\n* its beer\n\n### Foot Traffic\nDrivers consistently stop for pedestrians to cross the street. Who would have thought this a novel concept? Additionally, if a driver pulls their car in to a cross-walk, 9 times out of 10 that person will wave, apologize and attempt to back their car up so folks on foot have space to walk. This alone speaks reams about a community.\n\n### Service Industry Workers\nI am a harsh judge of patrons' character when it comes to their interactions with service industry workers. Is it right to judge people? No. Does doing so help me guage not only the person I'm speaking with, but a community as a whole? Yes, for watching an unnecessarily rude man be put in his place by other restaurant-goers is something special.\n\nOn the other side of the coin, I have yet to meet a rude person providing me food & bev service. A great example is at [Renegade Brewing](http://renegadebrewing.com/). The bar tenders here struck up conversation while I was having a beer and burger, alone, on Valentine's Day. After a few minutes of conversation, I was introduced to some of their friends across the bar, and we had great conversation and beer before parting ways.\n\n### The Beer\nThere are &gt;200 breweries in Denver. 'Nuff said. These people like to have a good time.\n\n## Remote Working\nMy employer, [Articulate](https://www.articulate.com/), has paid for me to work three days per week out of the [Density CoWorking](http://densitycoworking.com/) spot. Density is located in a fun neighborhood about one block from the [Marczyk Food Market](http://marczykfinefoods.com/). You know a place is cool when they have wall-mounted unicorn decor:\n\n<img src=\"/images/unicorn.jpg\" alt=\"Unicorn wall mount\" title=\"Unicorn wall mount\" />\n\nThere are heaps of unique and delicious coffee shops to work from, as well. My favorite, thus far, is the [Denver Bike Cafe](http://denverbicyclecafe.com/) on 17th Street.\n\n## Skiing\nWhile skiing in Denver could be fun after a heavy snow, the mountains are nearby and ripe for adventure. I'll let the pictures speak for themselves.\n\n<img src=\"/images/breck-tippy-top.jpg\" alt=\"Top of Breckenridge\" title=\"Top of Breckenridge\" />\n<br />\n<img src=\"/images/breck-america.jpg\" alt=\"Flag at top of Breck\" title=\"Flag at top of Breck\" />\n<br />\n<img src=\"/images/breck-edge.jpg\" alt=\"Flag at top of Breck\" title=\"Flag at top of Breck\" />\n\n## Wrap up\nI have only begun to scratch the surface with all that Denver has to offer and look forward to another month here.\n"},{"metadata":{"title":"Mobile Device Etiquette","date":"2015-03-09T00:00:00.000Z","image":"/images/phone-table.jpg","description":"Pay less attention to your device and more to those around you.","relativePath":"/blog/mobile-device-etiquette.html","friendlyDate":"Mar 9, 2015","type":"article"},"content":"\nA friend and colleague of mine, [Jason Vanderslice](https://twitter.com/javanderslice), and I recently discussed the state of mobile devices with regards to their place in various settings and within our interpersonal relationships. While I would not presume to speak for Jason on most subjects, we agree that mobile device etiquette is something that needs to be taught, spread to others and repeated.\n\nWith the evolution of digital, mobile devices came a million new ways to distract ourselves. Every new Twitter mention, Facebook tag, Instagram #hashtag, email, text and push notification is a jarring intrusion in to whatever we are doing that yearns for our attention and ultimate dismissal. Ignoring the vanity associated with thinking that we are important enough that our responses cannot wait (I'm not talking about you, doctors; you have a free pass with your 13 pagers), there is another aspect with which so many of us are tied to our phones: we want to clear messages and push notifications out of our lives as quickly as possible in order to avoid the stress of having so many of them build up. Everyone loathes the feeling of a mountain of emails crushing down on them. Everyone feels guilty about not returning that email their boss sent them at 11pm about XYZ big important project of the quarter. But something is lost&mdash;ignored, even: the consideration of those around us. Instead of focusing on the anxiety these acts alone cause us, I would like you to consider the effects your actions have on those around you.\n\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">So much fun hanging out with people nowadays <a href=\"http://t.co/Kqf325chY6\">pic.twitter.com/Kqf325chY6</a></p>&mdash; Jason Vanderslice (@jaVanderslice) <a href=\"https://twitter.com/jaVanderslice/status/574046254742704128\">March 7, 2015</a></blockquote>\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n## Being Present\nI want to tell you about a man who changed my life by setting an example. [Paul Singh](https://twitter.com/paulsingh), former partner at [500 Startups](http://500.co) and founder of [Disruption Corporation](http://www.disruption.vc), is a very well-known investor in the tech world and [single-handedly transforms cities](http://www.crystalcity.org/innovative/crystal-tech-fund) economically. You can safely bet that his phone is constantly buzzing with the latest killer app ideas, city construction issues and other problems that require his attention.\n\nI was fortunate enough to get to spend a day with Paul, [Marty Bauer](https://twitter.com/bauermarty) and heaps of other great folks at [The Iron Yard](http://theironyard.com) in Greenville, SC, last year, where Paul came to speak about what he was doing in Crystal City, Arlington, VA. We picked him up at the GSP airport and, after a night's rest, three of us met Paul at [Coffee Underground](http://www.coffeeunderground.info) for breakfast and coffee. While we sat there discussing life, the universe and everything, I was surprised how attentive and conversational Paul was. He listened to every word someone had to say, waited for them to finish, thought for a moment and then provided a relevant response and/or follow-up question.\n\nSo what's the big deal? Most people are taught from childhood how to have a conversation. Let's hear more.\n\nDuring his presentation, an attendee was most disrespectful, hijacking the presentation to seemingly blame Paul for the Industrial Revolution and subsequent child labor issues. As one would imagine, this had nothing to do with his presentation, but instead of putting the attendee down, Paul listened and responded to the attendee with respect while he received none. When it was clear there was to be no resolution to the original question, he closed the subject elegantly and continued his talk without skipping a beat.\n\nWhat do these two personal acedotes have to do with mobile device etiquette? _Everything._\n\nYou see, Paul Singh, whether at the coffee shop or giving a talk or speaking with attendees afterwards, was _present_. He was there with each person in each moment. When I confronted him about his persona and charisma, he mentioned a book, [The Charisma Myth](http://www.amazon.com/The-Charisma-Myth-Personal-Magnetism/dp/1591845947), which I of course purchased soon thereafter. This book explained, broke down and reinforced principles of interactions with others that had been taught to me in my youth, but behind which I had never fully understood the \"why\". While the book is a gold mine of information, there is a very large emphasis, with regards to exuding charisma, on presence. In short, **if you are distracted and not paying attention to someone you are with, this person will consciously or unconsciously believe that they are not important enough for your attention and will thus likely stop seeking to be in your presence simply because of the way you make them feel.**\n\nThink about that.\n\nHow many times have you been distracted by something, not just devices, when you have been with someone? How many times have you not answered their questions because something your mind deemed more important grabbed your attention? You may not be able to recall these instances, for they mean nothing to you. But now that you have read this far, you will undoubtedly begin to notice _others_ acting this way towards you. Don't worry, for seeing negative habits in others is the first step to changing your own.\n\n## You Might Be Distracted If...\n* you are sitting at the dinner table with your phone out\n* you are walking down the street with someone or a group with your phone out\n* you are making love and answer the phone\n* you are at a sporting event and Facebook just can't wait to know about how great your day is going\n* you ever have your phone/ipad/smart watch/digital dingus in hand while you are with another human being\n\n## Kids These Days\nMost folks these days know not what they do. The younger generation doesn't know a life without phonepads, and the older generation didn't know to ubiquitously enforce an etiquette around them. I believe there will eventually be a pendulum swing away from the current state of device affairs where mobile device etiquette becomes a standard, and considerations for this will continue to show up in new device features.\n\nIn the mean time, an interesting \"game\" has popped up among 20-somethings where everyone at dinner places their phones in the middle of the table, one on top of another. If anyone retrieves their phone during dinner, that person must then pick up the tab. Gamification... who would have thought? This is a great start.\n\n## So What Can You Do?\n\n### Step 1: Catch It\nIf you have to ask yourself,\n\n* * *\n\n> _&quot;Is it appropriate to take out my phone?&quot;_\n\n* * *\n\nthen the answer is probably no.\n\n### Step 2: Don't Be A Jerk\nWhen your friends are all tweeting about how much fun they're having during your birthday party at the pub, be careful with bringing attention to the subject. Not only will they be ashamed when they realize you are right, but they will also resent you for calling them out. However, being passive aggressive and hinting at their poor manners isn't the answer, either.\n\nIt is said that when you point at someone, you're pointing three fingers back at yourself. Instead, focus on making yourself better rather than being quick to judge others.\n\n### Step 3: Set the Example\nWhen you go to hang out with your little cousins or when you fly to give a talk to a group of strangers, turn your phone on silent (or Airplane Mode) and either keep it in your pocket at all times or even leave it in the car. If you have a necessary business meeting, plan it accordingly and if you must, take the call outside. Remember that every single person you come in to contact with is affected by the actions you take and the way you make them feel while they interact with you. Set the example and pass on good habits.\n"},{"metadata":{"title":"Stop Saying Silicon Harbor","date":"2015-03-23T00:00:00.000Z","image":"/images/morris-island.jpg","description":"Charleston, SC techpreneurs need to stop saying Silicon Harbor.","relativePath":"/blog/stop-saying-silicon-harbor.html","friendlyDate":"Mar 23, 2015","type":"article"},"content":"\nEver since [Nate DaPore](https://twitter.com/natedapore) allegedly coined the phrase [\"Silicon Harbor\"](http://charlestonmag.com/features/the_rise_of_silicon_harbor) for Charleston, South Carolina (even though other cities around the world already used this term, such as [Hamburg, Germany](https://twitter.com/siliconharbor)), folks wanting to look like they know what they're talking about have continued to use the phrase \"Silicon Harbor\" _[ad](http://www.fastcompany.com/1839445/introducing-silicon-harbor-charleston-sc-home-twitpic-and-amazons-createspace) [nauseam](http://www.charlestoncitypaper.com/charleston/silicon-harbor-is-becoming-a-major-player-in-the-nations-tech-scene/Content?oid=4604950)_. If Charleston tech companies would like to move forward and be taken seriously by other cities and players in this game, they need to stop emulating and start innovating. This begins with a proper name.\n\n\"Silicon Valley,\" the name that was copied and applied to Charleston as \"Silicon Harbor,\" got its nickname from the concentration of companies who specialized in making semiconductors and other computer-related products in the southern part of the San Francisco Bay Area. Silicon, which itself is a metalloid that is the most common element on our planet besides oxygen, is not unique to the Bay Area. It is in that location that an entire economy and culture grew around the semiconductor and then microprocessor and then software industries. Charleston, however, has no such story to support calling itself \"Silicon X.\" Here is a list of locations that have also called themselves \"Silicon X\" in the hopes of getting the scraps from Silicon Valley:\n\n* \"Silicon Beach\" - Bournemouth, England\n* \"Silicon Docks\" - Dublin, Ireland\n* \"Silicon Harbor\" - Hamburg, Germany\n* \"Silicon Lagoon\" - Lagos, Nigeria\n* \"Silicon Peninsula\" - Dailiar, China\n* \"Silicon Savannah\" - Nairobi, Kenya\n\n...and many more from the [List of Places with \"Silicon\" Names](http://en.wikipedia.org/wiki/List_of_places_with_%22Silicon%22_names).\n\nWhile this might all sound quite negative, it is necessary in order to break folks out of their \"Silicon Harbor\" daydreaming and recognize that riding the coattails of successful communities is not always the path to creating one. A community should be able to stand on its own merits, be unique in the world and at least strive to be its own unicorn-like entity.\n\nCharleston has an [impressive number of technology and creative companies](http://boomtownroi.com/chstechmap), as [BoomTown's](http://boomtownroi.com) useful map compilation shows, given the size of the city. Ask most anyone in the developed world what San Francisco means to them and the answer will include \"Silicon Valley,\" \"technology companies\" and \"innovation.\" Ask the same about Charleston and the answer will include \"beautiful architecture,\" \"great food,\" \"Southern Hospitality\" and _maybe_ \"Boeing.\" Nowhere outside of South Carolina will you hear people speak of Charleston's technology scene.\n\nWhy is this? Is it a lack of employment opportunities offered by companies in the area? Somewhat. Is it a lack of marketing? Partially. Is it a lack of novelty and significance in global consumers' lives? Definitely.\n\nIf Charleston is not going to be cranking out Apple/Google/???-ambitious tech, then it needs to learn to compete on other fronts. Human resource software, real estate software, healthcare software and assistive financial software are all important industries and employ a great number of people in the Charleston area. They also benefit their community and all give back in innumerable ways. However, there have yet to be any ground-breaking technologies to come out of Charleston since [Automated Trading Desk](http://www.atdesk.com), formerly led by [Steve Swanson](http://sb.cofc.edu/officeofthedean/boardofgovernors/swanson.php), busted on to the scene in the late 80s through the late 2000s with its utilization of high-frequency trading, a technology that revolutionized the stock trading industry. If Charleston dares to be great, then it should lead by example.\n\nPersonally, I am not as successful as the current folks [Mayor Joe Riley](https://en.wikipedia.org/wiki/Joseph_P._Riley,_Jr.) courts and supports as drivers of community growth. I have nothing to show. But what I do have is an outside view of the community while still maintaining my membership of it and participation in it. What I see is a city that has many of the traits of a progressive city on the rise but which constantly compares itself to others instead of charging forward as a leader.\n\nIt is in this light that I suggest Charleston abandon the overused and cliché \"Silicon X\" tag and adopt a new nickname (sorry to all you organizations who have named yourself \"Silicon Harbor X\"). Nobody uses it outside of the Charleston tech community, and nobody will (just as you don't call Baltimore, MD the \"Digital Harbor\"). It's time to move on.\n\nThis new nickname should represent the vast presence of technology companies as well as evoke all the right emotions for emphasizing that Charleston is a fantastic place to work, live and raise a family. But it should, above all else, represent the location and culture, itself, without having to rely on an overused, 60-year old term from the other side of the country.\n"},{"metadata":{"title":"Switching Jobs","date":"2015-06-04T00:00:00.000Z","image":"/images/edinburgh.jpg","description":"Announcement of switching jobs from Articulate to The Iron Yard.","relativePath":"/blog/switching-jobs.html","friendlyDate":"June 4, 2015","type":"article"},"content":"\nSelf-discipline can take you places you've never dreamed you would go.\n\nI have recently switched from one dream job to another one. For the past 1.5 years, [Articulate](https://www.articulate.com) has allowed me to roam from Washington, DC to Charlotte to Charleston to Atlanta to Greenville to Miami to Utah to London to Edinburgh to Berlin to northwest Spain to Denver and beyond. Without such an opportunity, I would never have met many of the people nor had the experiences that mean so much to me and helped me grow as a human being. Hopefully I helped a few folks along the way, as well.\n\nNow, however, I am shifting gears. [The Iron Yard](http://theironyard.com) will be my new home and might well take me to whole new levels of understanding, inter-personal relationships and travel. I will be teaching software in an accelerated course to highly motivated people who, of their own volition, are willing to spend >40 hours per week in my presence (the horror!). The first course will be in Charleston, SC, and other courses will be taught in an undisclosed location overseas (I don't think it's been officially announced).\n\n* * *\n\n> _&quot;But Robert! How does this help you travel?&quot;_\n\n* * *\n\nI'm glad you asked! Each \"cohort\" (class) is 12 weeks, and apart from the travel associated with being in different teaching locations, the work schedule goes like this: **_3 months on, 1 month off_**.\n\nI know&mdash;badass; time for travel, personal development and freelancing.\n\nBut what allowed me to get to this point, apart from dumb luck? _Self-discipline_. If you have the self-discipline to find your way through the boredom of working your back-side off day and night to not only learn new things but explore, meet new people and foster relationships with human beings of every race, gender and creed, you can do anything.\n\n* * *\n\n_[The Iron Yard - Charleston](http://theironyard.com/locations/charleston) is still taking applications for the class starting June 15, 2015. [Apply here](http://theironyard.com/apply) and learn you some code._\n"},{"metadata":{"title":"Delegate; Don't Dump","date":"2015-09-21T00:00:00.000Z","image":"/images/hinge.svg","description":"On being the hinge between someone with a question and someone else with a solution.","relativePath":"/blog/delegate-don-t-dump.html","friendlyDate":"Sept 21, 2015","type":"article"},"content":"\nA fellow employee, Margaret, contacts you and asks, &quot;Do you know anything about [problem] and how I might be able to solve it?&quot; You respond, &quot;Oh, yeah, Jane is handling that now.&quot; You are a busy person being crushed under the weight of your duties, and you have just helped someone. Having now pushed something off of your plate, it is time to address the next thing!\n\nBut then Margaret comes back to you and says that Jane isn't sure why you said she could solve this problem. Jane is confused, you are confused and Margaret is left floating in ambiguity without any direction nor answer and must go ask someone else and begin this cycle again. If this conversation happens via email, expect it to take multiple days and span multiple threads.\n\nWhy did this happen?\n\n## You are the hinge\nWhen someone reaches out to you and asks a question, and you believe someone else has the answer, then you are now effectively a hinge between these 2 people.\n\n<img src=\"http://s3.amazonaws.com/rpearce.github.io/delegate/hinge.svg\" alt=\"Hinge graphic\" title=\"Hinge graphic\" />\n\nYou are what connects that person's problem with his/her solution. When you do not _act_ as a hinge does and connect the two different parties, then both remain separate (read: you will now spend significantly more time than you would have originally spent figuring out a solution).\n\n## Delegate Like a Leader\nDelegating responsibility and empowering others are pivotal skills for leadership of any sort. How does it feel when you ask someone for their assistance, and they are incredibly helpful in getting you where you need to go? It feels pretty darn good. Why? Because you have a guide that either knows the way or knows someone who does. You know that you are in safe hands and that your problem will be solved. _You have a clear path to a solution and are thus empowered._\n\n## What To Do Next Time\nIf someone asks you a question or comes to you with a problem, it is because they believe you possess the solution. Instead of dumping them on to someone else, it might be in everyone's best interest to set up an introductory email/Google Hangout/Skype call to act as the hinge you are and hand one person off to another for safe-keeping. This way, you leave nothing to question, and if there are any issues, your group will immediately be on the same page and be able to find a solution much more quickly.\n"},{"metadata":{"title":"Long-Distance Movie Night","date":"2015-09-26T00:00:00.000Z","image":"/images/cary_grant.jpg","description":"Your significant other and you can do long-distance movie night easily. Here's how.","relativePath":"/blog/long-distance-movie-night.html","friendlyDate":"Sept 26, 2015","type":"article"},"content":"\nIn a long-distance relationship? I currently am, and it sucks, but that will change someday. My SO (significant other), who is an ocean away and five hours ahead, and I were recently celebrating the passing of time and wanted to share a movie night. How were we to do this?\n\nThere are many options out there that we explored, such as [Gaze](https://letsgaze.com), which has a great design (though a questionably shaky platform), but only supports `.mp4`, `.ogg` and `.woff` files (even if you alter the webpage to accept all file types). We had our movie in `.avi` and `.mov`, so this wasn't going to work.\n\nWe also tried a few other services but to no avail, so we put our thinking caps on and solved the problem with these simple steps:\n\n1. Make sure you and your SO each have a copy of the movie (sharing it via [Dropbox](https://www.dropbox.com) is a _big_ help here)\n1. Use Skype to video call your SO\n1. Open wine\n1. Do a countdown (3...2...1) for when each of you should click play\n1. Turn on the mute button when you're not talking/commenting so that his/her movie's sound doesn't come over the speakers\n\nThis was surprisingly easy, and Skype lets you keep a small version of the person you're video calling on top of all other screens, so I put her on the top left of my screen and presto! Long-distance movie night.`\n"},{"metadata":{"title":"Asynchronously Loading Scripts","date":"2015-10-05T00:00:00.000Z","image":"/images/rock-creek-pk.jpg","description":"Beginner-friendly introduction to loading scripts on to a web page.","relativePath":"/blog/asynchronously-loading-scripts.html","friendlyDate":"Oct 5, 2015","type":"article"},"content":"\n_This article is intended for HTML & JavaScript beginners._\n\n* * *\n\nWhere do you place your `<script>` tags to load your JavaScript for your\nwebsite? If you're doing this within the `<head>` element, you might\nwant to consider whether or not this is the best option for you.\n\n## Fetching JavaScript Synchronously\n\nSo long as HTTP/1.1 is what your website is accessed via (which it will be\na long while), `<script>` tags will be used to fetch external JavaScript\nfiles whose contents will be included on the page. These typically look\nlike `<script src=\"app.js\"></script>`. `<script>` tags are by default \"blocking,\" meaning that the web page has to pause its download & render cycle, fetch and load the JavaScript and then continue on. Here is what this looks like:\n\n```html\n<html>\n  <head>\n    <script src=\"app.js\"></script>\n  </head>\n  <body>\n    <div>My Website</div>\n  </body>\n</html>\n```\n\nThe worst thing you can do is load multiple scripts in this blocking\nfashion:\n\n```html\n<html>\n  <head>\n    <script src=\"jquery.js\"></script>\n    <script src=\"jquery.lightbox.js\"></script>\n    <script src=\"some_file.js\"></script>\n    <script src=\"app.js\"></script>\n  </head>\n  <body>\n    <div>My Website</div>\n  </body>\n</html>\n```\n\nso make sure you combine (concatenate) all your JavaScript files in to\none file. But this is still not ideal, for you have a blocking script\nthat will have to download before anything else happens.\n\nWhen we throw `<script>` tags at the end of the `<body>`, we allow for the page to paint and then go and fetch the JS synchronously (this lets the user see and utilize the page, but the scripts still haven't finished loading).\n\n```html\n<html>\n  <head></head>\n  <body>\n    <div>My Website</div>\n    <script src=\"app.js\"></script>\n  </body>\n</html>\n```\n\nHowever, since the page is still loading, search engines might punish you for a\nlong(er) loading time. What we might need, instead, is the ability to\nasynchronously fetch the JavaScript _after_ the page is finished\nloading.\n\n## Fetching JavaScript Asynchronously\nThere are two popular methods for fetch JavaScript in an asynchronous\nmanner.\n\nThe first is to simply include the HTML5 `async` property:\n\n```html\n<script src=\"app.js\" async></script>\n```\n\nOr, if you need to support older browsers, add an event listener to the window's `load` function to dynamically build a script tag and append it to the page (note how I do not use `window.onload =`):\n\n```html\n<script>\n  window.addEventListener('load', buildScriptTag);\n  function buildScriptTag() {\n    var script = document.createElement('script');\n    script.src = 'app.js';\n    document.body.appendChild(script); // append it wherever you want\n  }\n</script>\n```\n\nWhy didn't I use `window.onload =` here? When you assign a browser callback trigger a value, it can only have one value! When you add an event listener, you allow the window's load functionality to have more values in the future.\n\n## Conclusion\nIf your app/website is architected to rely on JavaScript before it\nrenders anything, then you can utilize this asynchronous\ntechnique with a \"Loading...\" graphic that is removed when the\nJavaScript loads. Ultimately, you want to decrease the amount of time it\ntakes for a web page to perform an initial load so that the user can get\nstarted using your project as quickly as possible. With asynchronous\nloading of JavaScript, you enable your users to get going ASAP and then\nallow for them to have a fancier experience once things load in the\nbackground.\n"},{"metadata":{"title":"Immediate Functions","date":"2015-10-06T00:00:00.000Z","image":"/images/sunrise.jpg","description":"Beginner-friendly introduction to immediate functions.","relativePath":"/blog/immediate-functions.html","friendlyDate":"Oct 6, 2015","type":"article"},"content":"\n_This article is intended for JavaScript beginners._\n\nThe browser environment is one big JavaScript `closure` that will encapsulate in its `scope` all of the code that is to be run. Because of this, any functions or variables that are created in `<script>` tags or external `.js` files that are _not_ defined within a function will end up as global variables! And we all know that global varibles are bad. Let's dig in to this some more.\n\nEvery time you define a function and then define a variable with `var` inside of that function, that variable _only_ exists inside of that function.\nFor example, what is the value of `result` that is logged to the console?\n\n```js\n// app.js\nfunction kelvinToFahrenheit(kelvin) {\n  var result = Math.round(kelvin * (9/5) - 459.67);\n  return result;\n}\nkelvinToFahrenheit(274.3);\nconsole.log(result);\n```\n\nThe correct answer would be `undefined` (with a nice error), for `result` only exists within the `scope` of the `kelvinToFahrenheit` function. However, the function `kelvinToFahrenheit` now exists globally.\n\nWhy does this matter? Well, when you include a script on to a web page, its code now becomes part of this global closure. So if you define `function kelvinToFahrenheit()` without giving it a separate closure or namespace (more on namespaces in a second), then it is now a \"global function,\" meaning that it exists in the global namespace. If any other library you ever include uses a variable called `router`, your variable (or that library's) is going to overwrite whichever came before it and cause massive issues. The same thing is true for variables:\n\n```js\n// app.js\nvar currentTempInKelvin = 294.11;\n```\n\nSo what are your options?\n\n## Immediately Invoked Function Expressions (IIFEs)\n\n```js\n// app.js\n;(function() {\n  // your code here\n})();\n```\n\nThe semi-colon here is a defensive technique used for when files are concatenated together--if somebody in one file forgets to close their file/library/definition out with a semi-colon, then your code is going to be an extension of theirs.\n\nThe `()` towards the end is nothing more than the invocation of the immediate function we've defined.\n\nThus, when you write\n\n```js\n// app.js\n;(function() {\n  var currentTempInKelvin = 294.11;\n})();\n```\n\nand then you try to `console.log(currentTempInKelvin);` from the browser's JavaScript console, you will get `undefined`, for `currentTempInKelvin` now only exists within that anonymous function's scope. Hurray! No more globals.\n\n* * *\n\nBut what if we want to access something in a global fashion? We know about the problems of name-clashing, so let's also try to reduce that. Let's combine what you did with the immediate function and do global variables in a less-bad way using _namespacing_.\n\n## Namespacing\n\nNamespacing allows us to limit our use of global variables to one global\nby nesting all of our functionality within one global object that we'll\ncall `WeatherApp`.\n\n```js\n// app.js\n// No var declaration means global!\n;(function() {\n  WeatherApp = {\n    kelvinToFahrenheit: {}\n  };\n})();\n```\n\nor\n\n```js\n// app.js\n;(function() {\n  WeatherApp = {};\n  WeatherApp.kelvinToFahrenheit = {};\n})();\n```\n\nor (better)\n\n```js\n// app.js\n;(function() {\n  window.WeatherApp = {};\n  window.WeatherApp.kelvinToFahrenheit = {};\n})();\n```\n\nor (recommended)\n\n```js\n// app.js\n;(function(scope) {\n  scope.WeatherApp = {};\n  scope.WeatherApp.router = {};\n})(this);\n```\n\nThis last method allows you to use this code and pass in any contextual scope. Since `this` is equivalent to `window` at the global level, when you run this in the browser, `this` is `window`, so `WeatherApp` will be added to the `window` global.\n\nWhen you leave out the `var`, you create a global variable, so be careful! I recommend being explicit with to what object you are adding a `namespace`. If you're going the global variable route, then you should nest every single thing you're doing inside of your `WeatherApp` namespace in order to avoid having more than 1 global variable.\n\n## Conclusion\nThis is a great pattern to utilize when you have relatively simple\nJavaScript you would like to add to a webpage and not have its contents\nclash with other libraries & code. If your code begins to get too\ncomplicated for this file, then we can start to look at the [CommonJS\nmodule exporting & requiring pattern](http://wiki.commonjs.org/wiki/Modules/1.1) that is currently implemented by the\nwonderful [Browserify](http://browserify.org) library (aka, Node.js but in the browser). I will cover this in the future, but in the\nmean time, leverage the power of immediate functions for great good!\n"},{"metadata":{"title":"Simple Variadic Behavior","date":"2015-10-13T00:00:00.000Z","image":"/images/waterfall.jpg","description":"Beginner-friendly introduction to variadic behavior.","relativePath":"/blog/simple-variadic-behavior.html","friendlyDate":"Oct 13, 2015","type":"article"},"content":"\n<p class=\"strikethrough\">Recently, I have started working on my own static site generator, [react-static](https://github.com/rpearce/react-static), to accomodate my markdown blog posting & static site needs. Another benefit is that I get to work on my Node.js and ES2015+ JavaScript skills. While I am reinventing the wheel on some levels, it is good practice.</p>\n\n__Update__: I made a library, [parse-md](https://www.npmjs.com/package/parse-md), out of some of this behavior in order to address the need of parsing metadata from markdown files.\n\nMy latest problem to solve was how, once I had a `.md` (Markdown) file's contents, to go about parsing out the blog post's metadata (see below: the key/value pairs between the two `---`s).\n\n```\n---\ntitle: This is a test\ndescription: Once upon a time, there was a test...\n---\n\n# Title of my great post\nLorem ipsum dolor...\n\n## Some heading\nBacon ipsum...\n```\n\nOnce I `split` this file based on newlines, I needed a way of finding the indices of the metadata boundary, `---`, so that I could `splice` the array in to two pieces and be on my way. My first attempt at getting the indices looked like this:\n\n```js\nfunction getMetadataIndices(lines) {\n  var arr = [];\n  lines.forEach((line, i) => {\n    if (/^---/.test(line)) {\n      arr.push(i);\n    }\n  });\n  return arr;\n}\n\ngetMetadataIndices(lines); // [0, 3]\n```\n\nThis is a simple solution that any junior dev can do, and it accomplishes the task... but it doesn't feel right. I am iterating over each item, testing each line and mutating an array variable when a condition is true. While it doesn't look like much, that is a good bit going on all at once. Instinct tells me that each action could be its own simple method. I also don't want to use a temporary variable that I mutate. However, this removes `forEach` from our options, as `forEach` returns the original array. `map()` to the rescue! (or so we think).\n\n```js\nfunction getMetadataIndices(lines) {\n  return lines.map(testForBoundary);\n}\n\nfunction testForBoundary(item, i) {\n  if (/^---/.test(item)) {\n    return i;\n  }\n}\n\ngetMetadataIndices(lines); // [0, undefined, undefined, 3, undefined, undefined, undefined, undefined, undefined, undefined]\n```\n\nCrap. Because I only return when the test is true, `map` doesn't know what to return, so it returns `undefined` and moves on. It would be nice if we could clean out these `undefined`s!\n\n## Cleaning Up Our Array\nHow can we achieve the following desired functionality?\n\n```js\nfunction getMetadataIndices(lines) {\n  return lines.map(testForBoundary).clean(undefined);\n}\n\ngetMetadataIndices(lines); // [0, 3]\n```\n\nLet's make a function on the `prototype` of `Array` called `clean`:\n\n```js\nArray.prototype.clean = function(trash) {\n};\n```\n\nHere, we access `Array`'s `prorotype` and add our own custom method, `clean` and pass it one argument. Next, we need to `filter` out all of the `undefined`s in our array.\n\n```js\nArray.prototype.clean = function(trash) {\n  return this.filter(item => item !== trash);\n};\n```\n\nBut what if we need to clean more than one value out? What if we need to clean `null`, `\"\"` and `undefined`?\n\n## Variadic Behavior\nIn JavaScript, _variadic behavior_ is a fancy term applied to functions that can accept and handle any number of arguments, and these are typically accessed within the function via the `arguments` object, which looks like an `Array` but is _not_. For example, this code will give you an error about `indexOf` not being defined on `arguments`.\n\n```js\nArray.prototype.clean = function(trash) {\n  return this.filter(item => arguments.indexOf(item) === -1);\n};\n```\n\nDrats! `arguments` is very similar to an array &mdash; how can we get this to work? `slice` to the rescue!\n\n```js\nArray.prototype.clean = function() {\n  const args = [].slice.call(arguments);\n  return this.filter(item => args.indexOf(item) === -1);\n};\n```\n\nWithout any additional arguments, `slice` makes a copy of an array and allows us to provide a custom receiver of array-like functionality: `arguments`. What is returned from the second line above is an array-ized _copy_ of `arguments`. Now that `args` is an array of all the arguments that are passed to `clean`, we can pass as many options as we would like to clean out our array!\n\nHere is more example usage of such a method:\n\n```js\n// Usage\nconst arr = [\"\", undefined, 3, \"yes\", undefined, undefined, \"\"];\narr.clean(undefined); // [\"\", 3, \"yes\", \"\"];\narr.clean(undefined, \"\"); // [3, \"yes\"];\n```\n\n## All Together\nIn attempting to refactor some fairly simple, though multiple-responsibility code, we end up creating a few reusable functions that will benefit us in the future, and we make our code more maintainable, testable and readable in the end. Here it is once we have finished:\n\n```js\nfunction getMetadataIndices(lines) {\n  return lines.map(testForBoundary).clean(undefined);\n}\n\nfunction testForBoundary(item, i) {\n  if (/^---/.test(item)) {\n    return i;\n  }\n}\n\nArray.prototype.clean = function() {\n  const args = [].slice.call(arguments);\n  return this.filter(item => args.indexOf(item) === -1);\n};\n```\n\nBut could this be done _even_ simpler?\n\n## p.s. Use reduce next time\nYou may have been wondering why we didn't use `reduce` like this from the start:\n\n```js\nlines.reduce(function(mem, item, i) {\n  if (/^---/.test(item)) {\n    mem.push(i);\n  }\n  return mem;\n});\n```\n\nor, cleaned up a bit,\n\n```js\nfunction getMetadataIndices(mem, item, i) {\n  if (/^---/.test(item)) {\n    mem.push(i);\n  }\n  return mem;\n}\n\nlines.reduce(getMetadataIndices, []);\n```\n\nSurprise! We totally could have, but since `reduce` was not our first thought when refactoring, we managed to solve our problem in another way. There are 1000 ways to solve problems, and sometimes you don't think of the best one first, but you can still make the best with what you have at the time and refactor later.\n"},{"metadata":{"title":"Freelancing","date":"2015-10-14T00:00:00.000Z","image":"/images/mtn.jpeg","description":"Some thoughts on freelancing in the software development business.","relativePath":"/blog/freelancing.html","friendlyDate":"Oct 14, 2015","type":"article"},"content":"\nSandy beaches; downhill skiing; coffee shop Hugh Grant-esque romance. When people imagine themselves leaving their corporate jobs and becoming their own boss, moving from project to project as a knife through butter, they envision themselves living the good life and doing so _on their terms_. This is absolutely possible to achieve, but as with anything, freelancing isn't all rainbows and unicorns! But we want rainbows; we want unicorns. How can we get to this point? Let's start at the bottom.\n\n## Freelancing is Tough\nAs soon as you leave your large organization, there is a very strange sensation that is exhilarating and terrifying all at once: _I am now responsible for everything, and if I fail at any one thing in this chain, I fail._ What is encompassed by \"everything?\" Let's take a look at what we'll talk about for the rest of the post: software freelancing.\n\n* Marketing\n* Sales\n* Strategy\n* Research\n* Development\n  * Frontend: UI, UX, prototyping, information architecture, functionality, QA/testing\n  * Backend: API, server architecture, data stores, scaling, QA/testing\n  * Or both\n* Invoicing\n\nHere's some very basic logic based off of these responsibilities:\n\n* If you cannot market yourself and your skills, you cannot get in the door.\n* If you cannot sell, you cannot close a deal.\n* If you cannot build the product in a timely fashion and deliver what you promised, you'll be in trouble.\n* If you cannot collect money from clients, your business does not get paid.\n* If any of these steps fail, the path to getting paid is closed.\n\nWhat's more, how do you know if the client you are selling is a client you actually want to work with? How can both parties vet one another?\n\n## Building Relationships\nOne way to get around many of the issues you run in to while freelancing that are related more to the business side than what you actually create is to foster relationships with businesses locally (or remotely, if you can manage that across the Internet). Attending meetups, lectures, happy hours, conferences, hackathons, open houses and the like are great ways to meet folks in your community and get to know them and their businesses. The more knowledgeable all parties are with one another, the more they can suss out whether or not they want to work with each other. Once someone has a good experience with you, it is more likely that they will come to you again to solve their problems.\n\nIf you can build enough relationships, you may not need to go outside of your local community for work. But what if your city doesn't have enough work for you or you travel regularly? What if you want to expand your freelance reach to a national level?\n\n## Finding Non-Local Work\nWithout an agency or consultancy brand name behind you, finding work from organizations outside of your network could be difficult. There are a number of services which help you, such as [Elance](https://www.elance.com/) and [Gun.io](https://gun.io/), but the one that really caught my eye was [toptal](https://www.toptal.com).\n\nWhat really stuck out to me was the concept of their only accepting what they call the [\"top 3%\"](http://www.toptal.com/top-3-percent) of people that apply. Their rigid screening process ensures that only quality developers are admitted to their community. To me, this guarantees prestige and sets the bar very high. This also means that, as a marketplace, toptal would need to ensure that clients are legit and responsible, as well. In sum, toptal\n\n* connects you (freelancer) with vetted, great employers\n* gives businesses an elite group of A+ players from which to choose for their business' needs\n* handles the money\n\nand much more.\n\nI want to work with the best clients, and I want clients to receive the best work possible. I have just started the process for joining [the toptal Web developers network](http://www.toptal.com/web) to pick up additional work, look forward to the challenges of the screening process and hope to make it through!\n\n## Do What Works For You\nIf you enjoy working in your local area, then get to work building relationships and a pipeline of backed up work as far as the eye can see with people in your area! But if you plan on going national/international, consider giving [toptal](https://www.toptal.com) a shot and show them what you're made of.\n"},{"metadata":{"title":"Missing Those We Love","date":"2016-02-02T00:00:00.000Z","image":"/images/from_afar.jpg","description":"Missing people in your life? Ask yourself why, and then go see them or give them a call.","relativePath":"/blog/missing-those-we-love.html","friendlyDate":"Feb 2, 2016","type":"article"},"content":"\nPerspective is a strange thing. It rips us out of our frame of thought, showing us our lives from a different point of view, forcing an evolution of ourselves for which we may not have asked. One such perspective I've encountered numerous times and resisted is the fact that those whom I care about will not always be around; they won't always be back home; they won't always be alive; they won't always wait for me to return. This naturally leads to questions like _where am I now, and what am I really doing here? Why? Is it worth all the lost time with those you care about?_ You hope so. You hope to live without regret and to have lived life to the fullest. But then perspective grabs hold, and while the whiplash is still fresh, turns you on your head.\n\nIt is never too late until it is. Right this very instant, no matter what your logical brain thinks, you can go home, bake a cake with grandma, ride bikes with your aunt, watch the sun set with a sibling and/or make dinner with old friends who are now married and settling down.\n\nMake sure you ask yourself, if you are away, _why_ you are doing what you are doing. If there is no good answer, act on it before the feeling passes. If there is a good answer, then stop what you're doing and give someone you miss a call.\n"},{"metadata":{"title":"Turning A New Leaf","date":"2016-02-22T00:00:00.000Z","image":"/images/path.jpg","description":"Two weeks ago today, I quit a rewarding and lucrative job without having another gig lined up. Oh, sh*t.","relativePath":"/blog/turning-a-new-leaf.html","friendlyDate":"Feb 22, 2016","type":"article"},"content":"\nTwo weeks ago today, I quit a rewarding and lucrative job without having another gig lined up. Oh, sh\\*t.\n\n## The Immediate Aftermath\nThe following day consisted of my mind completely shutting down after being unable to answer the following questions:\n* What do I do about health & dental insurance?\n* How am I going to pay for life?\n  * rent (in London)\n  * food/house supplies\n  * transportation\n  * what if I break my leg?\n  * what if I get [bit by a snake like Jules Weiss](http://www.medicaldaily.com/55000-snake-bite-has-uninsured-maryland-woman-jules-weiss-searching-options-anti-venom-costs-more) and get footed a $55,000 bill?\n* Should I start looking for a new job?\n* Should I get an actual undergrad degree in the industry I'm in? (how to afford this without debt?)\n* Should I go to business school? (how to afford this without debt?)\n* Am I in the right industry?\n* Should I start over?\n\nApple's Healthkit app on my phone told me I walked _10 steps_ that day and not many more the next. Clearly, something had to be done.\n\n## Organizing My Concerns\nAfter a few days of lethargy and absorption of what I'd done and what had happened, my mind became restless and went back in to \"solve all the things!\" mode. When something feels like too big of a task, I remember what my father has asked me since childhood, _How do you eat an elephant? One bite at a time._ Now, I am not advocating for the consumption of elephants, but you get the point. It was time to break the problem of \"What do I do next?\" in to many smaller, solvable problems.\n\n_Disclaimer: I am not an healthcare nor life expert; this is a story._\n\n### Healthcare & Retirement Account(s)\nWhen it comes to the unknown, humility is an asset, for you cannot possibly know everything about everything, so it's okay to ask people for help. If you're in this position, make sure you listen to your human resources contact at the company you're leaving, specifically\n* how long your healthcare is covered for under their plan\n* the details about making the COBRA election to extend your healthcare at your own cost\n* if you have a high-deductible healthcare plan and have a health savings account (HSA) of your own, what can you do with this? How does that work, and where do I go from here with it? It is yours, but their advice is valuable.\n* how you can rollover your retirement accounts in to other ones? (I have my own, managed via Schwab)\n\nAdditionally, consult your bank/brokerage firm/family/life liason about what your options are and what they think you need to do to ensure you are handling these things correctly. This is what I have been doing, and it is such a relief when someone can help you down your path.\n\n### Paying for Life\nNaturally, since I have no income until I either sell a product or do freelance work, expenses have had to be slashed. Eating out, pubs, entertainment, etc., are not great expenses until I add up their cost over a year. Rent, healthcare and car insurance are the major killers. There's no way I'd be able to even be thinking this way with a family to support, so I've got it relatively easy. Luckily, I saved up a bit of money before quitting, so I am cushioned for a little bit.\n\nHowever, frugal is the word.\n\n### What Do I Want and Need?\nOnce I got past the immediate financial and health issues I was able to start tackling the next question: _what do I want and need?_\n\nI came up with potential paths to go down, sought advice from family and friends, and came up with the things I need in my life:\n* be where I need to be (with my significant other after a year apart)\n* recover from the mindset I've been in for the last 6 months and allow myself to change and not be defined by it\n* level-up my programming skills and algorithmic knowledge\n* make something that matters and which matters _to me_\n* work for myself for a bit\n\nThere were so many other contenders that, after examing what mattered to me and defining what was just outside my sphere of knowledge and influence, didn't make sense for right now.\n\n## Turning a New Leaf\nCurrently, I am spending my days focused on learning and working. Here's my routine:\n* wake up, brew some tea or coffee\n* light exercise\n* solve coding problems on [CodeWars](http://www.codewars.com/)\n* work on basic algebra/trig/geometry/calculus skills that I either don't remember or never learned via worksheets\n* spend 4-5 hours on a MOOC (massive open online course)\n* exercise\n* spend the rest of the working day working on my own projects (or, eventually, freelance work)\n* play my guitar and record music or a potential podcast\n* enjoy life and friends\n\nThis daily routine allows me to get things done that matter to me, cut out the things that don't and make sure I stop and smell the flowers along the way.\n\n## Thank Yous\nThank you Emily, my family, [Jason Vanderslice](https://twitter.com/javanderslice), [Marty Bauer](https://twitter.com/bauermarty), [James Dabbs](https://twitter.com/jamesdabbs) and the rest of you (you know who you are) for your guidance, encouragement and friendship.\n"}]}